//-------------------------------------------------
//пример объекта
//-------------------------------------------------

// let obj ={
//     name :'WFM',
//     age:20
// };
//
// let name =obj.name;
// let age =obj.age;
//
// console.log(name, age);

//-------------------------------------------------
//можно переписать так
//-------------------------------------------------

let obj ={
    name :'WFM',
    age:20
};
//---------1вариант
// let {name}=obj2;
// let {age} =obj2;

//---------2вариант
let {name, age}=obj;

console.log(name, age);
