//-----------------------------------------------------------------------
//было так
//-----------------------------------------------------------------------
const funct =(a)=>{
    // означает что если значение будет undefinde то значение возмет 15
    a =a || 15;
    return a;
};

console.log(funct());

//-----------------------------------------------------------------------
//стало так
//-----------------------------------------------------------------------
const funct1 =(a=20)=>{

    return a;
};

console.log(funct1());

//-----------------------------------------------------------------------
//можно добавить еще значения
//-----------------------------------------------------------------------
const funct2 =(a=20, b=50)=>{

    return a+b;
};

console.log(funct2());
console.log(funct2(20));
console.log(funct2(undefined,80));

//-----------------------------------------------------------------------
//можно добавить некоторые арифметические действия внутрь самой функции
//-----------------------------------------------------------------------
const funct3 =(a=20, b=a+50)=>{

    return a+b;
};

console.log(funct3());

//-----------------------------------------------------------------------
// можно даже добавить внешнюю переменную
//-----------------------------------------------------------------------

const c = 90;

const funct4 =(a=20, b=a+c)=>{

    return a+b;
};

console.log(funct4());


//-----------------------------------------------------------------------
// можно добавить даже функцию
//-----------------------------------------------------------------------

const c2 = () => 200;

const funct5 =(a=20, b=a+c2())=>{

    return a+b;
};

console.log(funct5());
