//стандартная функция
const origial= function(){
    return 100;
};
console.log(origial());

//-----------------------------------------------------------------------
//стрелочная функция
const arrow = () =>{
    return 150;
};

console.log(arrow());

//-----------------------------------------------------------------------
//передаем значения
const arrow1 = (num, num2) =>{
    return 150+num+num2;
};
console.log(arrow1(2,5));

//-----------------------------------------------------------------------
//если возвращать не много можно предыдущий вариант записать так
const arrow2 = (num, num2) => 150+num+num2;

console.log(arrow2(2,9));

//-----------------------------------------------------------------------
//если приходит один параметр можно сократить еще
const arrow3 = num => 150+num;

console.log(arrow3(2));
